name: "HandChallenge3DIntegral"



#-----load validation index from file
#layer {
  #name: "image_index"
  #type: "ReadIndexFromFile"
  #top: "image_index"
  #read_index_from_file_param {
     #batch_size: 1
     #index_file_path: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\frame\\test_index.txt"
	 #current_index_file_path: "cur_id_realtest.txt"
	 #num_of_samples: 2000
  #}
  #include {
     #phase: TEST
  #}
#}


#-----Generate sequential index for testing
#layer {
  #name: "image_index"
  #type: "GenSequentialIndex"
  #top: "image_index"
  #gen_sequential_index_param {
     #batch_size: 25
	 #current_index_file_path: "cur_id_realtest.txt"
	 #num_of_samples: 295510
	 #start_index: 1
  #}
  #include {
     #phase: TEST
  #}
#}



#-----Generate random image index for training 0
layer {
  name: "image_index_0"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_0"
  gen_rand_index_param {
     index_lower_bound: 1
	 index_upper_bound: 95703
	 batch_size: 1
     missing_index_file: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\missing_index.txt"
  }
  include {
     phase: TRAIN
  }
}

#-----Generate random image index for training 1
layer {
  name: "image_index_1"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_1"
  gen_rand_index_param {
     index_lower_bound: 95704
	 index_upper_bound: 191406
	 batch_size: 1
     missing_index_file: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\missing_index.txt"
  }
  include {
     phase: TRAIN
  }
}

#-----Generate random image index for training 2
layer {
  name: "image_index_2"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_2"
  gen_rand_index_param {
     index_lower_bound: 191407
	 index_upper_bound: 287109
	 batch_size: 1
     missing_index_file: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\missing_index.txt"
  }
  include {
     phase: TRAIN
  }
}

#-----Generate random image index for training 3
layer {
  name: "image_index_3"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_3"
  gen_rand_index_param {
     index_lower_bound: 287110
	 index_upper_bound: 382812
	 batch_size: 1
     missing_index_file: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\missing_index.txt"
  }
  include {
     phase: TRAIN
  }
}

#-----Generate random image index for training 4
layer {
  name: "image_index_4"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_4"
  gen_rand_index_param {
     index_lower_bound: 382813
	 index_upper_bound: 478515
	 batch_size: 1
     missing_index_file: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\missing_index.txt"
  }
  include {
     phase: TRAIN
  }
}



#-----Generate random image index for training 5
layer {
  name: "image_index_5"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_5"
  gen_rand_index_param {
     index_lower_bound: 478516
	 index_upper_bound: 574218
	 batch_size: 1
     missing_index_file: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\missing_index.txt"
  }
  include {
     phase: TRAIN
  }
}


#-----Generate random image index for training 6
layer {
  name: "image_index"
  type: "DeepHandModelGenRandIndex"
  top: "image_index"
  gen_rand_index_param {
     index_lower_bound: 574219
	 index_upper_bound: 669921
	 batch_size: 1
     missing_index_file: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\missing_index.txt"
  }
  include {
     phase: TEST
  }
}

#-----Generate random image index for training 7
layer {
  name: "image_index_7"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_7"
  gen_rand_index_param {
     index_lower_bound: 669922
	 index_upper_bound: 765624
	 batch_size: 1
     missing_index_file: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\missing_index.txt"
  }
  include {
     phase: TRAIN
  }
}

#-----Generate random image index for training 8
layer {
  name: "image_index_8"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_8"
  gen_rand_index_param {
     index_lower_bound: 765625
	 index_upper_bound: 861327
	 batch_size: 1
     missing_index_file: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\missing_index.txt"
  }
  include {
     phase: TRAIN
  }
}

#-----Generate random image index for training 9
layer {
  name: "image_index_9"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_9"
  gen_rand_index_param {
     index_lower_bound: 861328
	 index_upper_bound: 944064
	 batch_size: 1
     missing_index_file: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\missing_index.txt"
  }
  include {
     phase: TRAIN
  }
}

#-----Concat the indexes leave image_index_4 out
layer {
  name: "image_index_concat"
  type: "Concat"
  bottom: "image_index_0"
  bottom: "image_index_1"
  bottom: "image_index_2"
  bottom: "image_index_3"
  bottom: "image_index_4"
  bottom: "image_index_5"
  #bottom: "image_index_6"
  bottom: "image_index_7"
  bottom: "image_index_8"
  bottom: "image_index_9"
  top: "image_index_concat"
  include {
     phase: TRAIN
  }
}

#-----Random choose from one index
layer {
  name: "image_index"
  type: "CrossValidationRandomChooseIndex"
  bottom: "image_index_concat"
  top: "image_index"
  include {
     phase: TRAIN
  }
}




#----- Read bbx width height Train
layer {
  name: "read_bbx_width_height"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "bbx_width_height"
  read_blob_from_file_indexing_param {
     file_prefix: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\training\\wy_Norm_0822\\bbx_1101_meanscale180\\"
	 num_to_read: 4
  }

}



#-----Slice to bbx_x1 bbx_y1 width height
layer {
  name: "slice_bbx_width_height"
  type: "Slice"
  bottom: "bbx_width_height"
  top: "bbx_x1"
  top: "bbx_y1"
  top: "width"
  top: "height"
  slice_param {
     axis: 1
	 slice_point: 1
	 slice_point: 2
	 slice_point: 3
  }  
}

#----- Generate bbx_x2
layer {
  name: "bbx_x2"
  type: "Eltwise"
  bottom: "bbx_x1"
  bottom: "width"
  top: "bbx_x2"
  eltwise_param {
     operation: SUM
  }
}

#----- Generate bbx_y2
layer {
  name: "bbx_y2"
  type: "Eltwise"
  bottom: "bbx_y1"
  bottom: "height"
  top: "bbx_y2"
  eltwise_param {
     operation: SUM
  }
}



#----- Read GT centroid (3 dimensions)
layer {
  name: "gt_centroid"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "gt_centroid"
  read_blob_from_file_indexing_param {
     file_prefix: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\training\\wy_Norm_0822\\gt_centroid_qf_1101_meanscale180\\"
	 num_to_read: 3 
  }  

}




#----- slice GT centroid to get center_x center_y center_z
layer {
  name: "slice_gt_centroid"
  type: "Slice"
  bottom: "gt_centroid"
  top: "gt_center_x"
  top: "gt_center_y"
  top: "gt_center_z"
  slice_param {
     axis: 1
	 slice_point: 1
	 slice_point: 2
  }
}



#----- Read wy's processed depth image No BBX With Centroid z 
layer {
  name: "image"
  type: "DeepHandModelReadDepthNoBBXWithAVGZ"
  bottom: "image_index"
  bottom: "gt_center_z"
  top: "image"
  read_depth_no_bbx_with_avgz_param {
     file_prefix: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\training\\wy_Norm_0822\\subbg_v0_xiaotao_hands_train_meanscale180\\image_D"
	 depth_size: 256
  }

}




#----- Get min_x   200*200*200 cube so half is 100
layer {
  name: "min_x"
  type: "AddVectorByConstant"
  bottom: "gt_center_x"
  top: "min_x"
  add_vector_by_constant_param {
     add_value: -100.0
  }
}

#----- Get max_x
layer {
  name: "max_x"
  type: "AddVectorByConstant"
  bottom: "gt_center_x"
  top: "max_x"
  add_vector_by_constant_param {
     add_value: 100.0
  }
}

#----- Get min_y
layer {
  name: "min_y"
  type: "AddVectorByConstant"
  bottom: "gt_center_y"
  top: "min_y"
  add_vector_by_constant_param {
     add_value: -100.0
  }
}

#----- Get max_y
layer {
  name: "max_y"
  type: "AddVectorByConstant"
  bottom: "gt_center_y"
  top: "max_y"
  add_vector_by_constant_param {
     add_value: 100.0
  }
}

#----- Get min_z
layer {
  name: "min_z"
  type: "AddVectorByConstant"
  bottom: "gt_center_z"
  top: "min_z"
  add_vector_by_constant_param {
     add_value: -100.0
  }
}

#----- Get max_z
layer {
  name: "max_z"
  type: "AddVectorByConstant"
  bottom: "gt_center_z"
  top: "max_z"
  add_vector_by_constant_param {
     add_value: 100.0
  }
}

#------Get the gt 3d in local XYZ world coordinate
layer {
  name: "gt_joint_3d_read"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "gt_joint_3d_read"
  read_blob_from_file_indexing_param {
    file_prefix: "D:\\handpose\\HANDS17_challenge_dataset\\HANDS17_challenge_dataset\\training\\wy_Norm_0822\\gt_joint_3d_local_1101_meanscale180\\"
	num_to_read: 63
  }
  
}

#------Narrow it down to 200*200*200 cube
layer {
  name: "gt_joint_3d"
  bottom: "gt_joint_3d_read"
  top: "gt_joint_3d"
  type: "ScaleVector"
  scale_vector_param {
     scale_factor: 2.0
  }
  
}





#------Get the origin gt 3d
layer {
  name: "gt_joint_3d_raw"
  type: "DeepHandModelCubiodIntoGlobalV2"
  bottom: "gt_joint_3d"
  bottom: "min_x"
  bottom: "max_x"
  bottom: "min_y"
  bottom: "max_y"
  bottom: "min_z"
  bottom: "max_z"
  top: "gt_joint_3d_raw"
  
}

#------Get the origin gt 2d in UVD image coordinate
layer {
  name: "gt_joint_2d_raw"
  type: "DeepHandModelPinholeCameraOrigin"
  bottom: "gt_joint_3d_raw"
  top: "gt_joint_2d_raw"
  pinhole_camera_origin_param {
     focusx: 475.065948
     focusy: 475.065857
     u0offset: 315.944855
     v0offset: 245.287079
  }
  
}

#------Get the local projection(render) coordinate([0, 1])
layer {
  name: "gt_joint_2d"
  type: "DeepHandModelProjectionGlobal2Local"
  bottom: "gt_joint_2d_raw"
  bottom: "bbx_x1"
  bottom: "bbx_y1"
  bottom: "bbx_x2"
  bottom: "bbx_y2"
  top: "gt_joint_2d"
  
}




#slice normalized gt joint 3d 
layer {
  name: "slice_gt_joint_3d"
  type: "Slice"
  bottom: "gt_joint_3d"
  slice_param {
     axis: 1
	 slice_point: 2
	 slice_point: 3
	 slice_point: 5
	 slice_point: 6
	 slice_point: 8
	 slice_point: 9
	 slice_point: 11
	 slice_point: 12
	 slice_point: 14
	 slice_point: 15
	 slice_point: 17
	 slice_point: 18
	 slice_point: 20
	 slice_point: 21
	 slice_point: 23
	 slice_point: 24
	 slice_point: 26
	 slice_point: 27
	 slice_point: 29
	 slice_point: 30
	 slice_point: 32
	 slice_point: 33
	 slice_point: 35
	 slice_point: 36
	 slice_point: 38
	 slice_point: 39
	 slice_point: 41
	 slice_point: 42
	 slice_point: 44
	 slice_point: 45
	 slice_point: 47
	 slice_point: 48
	 slice_point: 50
	 slice_point: 51
	 slice_point: 53
	 slice_point: 54
	 slice_point: 56
	 slice_point: 57
	 slice_point: 59
	 slice_point: 60
	 slice_point: 62
  }
  top: "gt_joint_2d_0"
  top: "gt_depth_0"
  top: "gt_joint_2d_1"
  top: "gt_depth_1"
  top: "gt_joint_2d_2"
  top: "gt_depth_2"
  top: "gt_joint_2d_3"
  top: "gt_depth_3"
  top: "gt_joint_2d_4"
  top: "gt_depth_4"
  top: "gt_joint_2d_5"
  top: "gt_depth_5"
  top: "gt_joint_2d_6"
  top: "gt_depth_6"
  top: "gt_joint_2d_7"
  top: "gt_depth_7"
  top: "gt_joint_2d_8"
  top: "gt_depth_8"
  top: "gt_joint_2d_9"
  top: "gt_depth_9"
  top: "gt_joint_2d_10"
  top: "gt_depth_10"
  top: "gt_joint_2d_11"
  top: "gt_depth_11"
  top: "gt_joint_2d_12"
  top: "gt_depth_12"
  top: "gt_joint_2d_13"
  top: "gt_depth_13"
  top: "gt_joint_2d_14"
  top: "gt_depth_14"
  top: "gt_joint_2d_15"
  top: "gt_depth_15"
  top: "gt_joint_2d_16"
  top: "gt_depth_16"
  top: "gt_joint_2d_17"
  top: "gt_depth_17"
  top: "gt_joint_2d_18"
  top: "gt_depth_18"
  top: "gt_joint_2d_19"
  top: "gt_depth_19"
  top: "gt_joint_2d_20"
  top: "gt_depth_20"
  
}

#----nothing gt joint 2d
layer {
  bottom: "gt_joint_2d_0"
  bottom: "gt_joint_2d_1"
  bottom: "gt_joint_2d_2"
  bottom: "gt_joint_2d_3"
  bottom: "gt_joint_2d_4"
  bottom: "gt_joint_2d_5"
  bottom: "gt_joint_2d_6"
  bottom: "gt_joint_2d_7"
  bottom: "gt_joint_2d_8"
  bottom: "gt_joint_2d_9"
  bottom: "gt_joint_2d_10"
  bottom: "gt_joint_2d_11"
  bottom: "gt_joint_2d_12"
  bottom: "gt_joint_2d_13"
  bottom: "gt_joint_2d_14"
  bottom: "gt_joint_2d_15"
  bottom: "gt_joint_2d_16"
  bottom: "gt_joint_2d_17"
  bottom: "gt_joint_2d_18"
  bottom: "gt_joint_2d_19"
  bottom: "gt_joint_2d_20"
  top: "gt_joint_2d_nothing"
  name: "gt_joint_2d_nothing"
  type: "Concat"
  
}

layer {
  top: "joint_2d_nothing"
  name: "joint_2d_nothing"
  bottom: "gt_joint_2d"
  bottom: "gt_joint_2d_nothing"
  loss_weight: 0.0
  type: "EuclideanLoss"
  
}


layer {
  bottom: "gt_depth_0"
  bottom: "gt_depth_1"
  bottom: "gt_depth_2"
  bottom: "gt_depth_3"
  bottom: "gt_depth_4"
  bottom: "gt_depth_5"
  bottom: "gt_depth_6"
  bottom: "gt_depth_7"
  bottom: "gt_depth_8"
  bottom: "gt_depth_9"
  bottom: "gt_depth_10"
  bottom: "gt_depth_11"
  bottom: "gt_depth_12"
  bottom: "gt_depth_13"
  bottom: "gt_depth_14"
  bottom: "gt_depth_15"
  bottom: "gt_depth_16"
  bottom: "gt_depth_17"
  bottom: "gt_depth_18"
  bottom: "gt_depth_19"
  bottom: "gt_depth_20"
  top: "gt_depth"
  name: "gt_depth"
  type: "Concat"
  
}













layer {
  name: "gen_3d_hm"
  bottom: "gt_joint_2d"
  bottom: "gt_depth"
  top: "label"
  type: "DeepHandModelGen3DHeatmap"
  deep_hand_model_gen_3d_heatmap_param {
    depth_dims: 64
	map_size: 64
	sigma: 0.167
	joint_num: 21
  }
  
}






layer {
 name: "conv_1"
 type: "Convolution" 
 bottom: "image" 
 top: "conv_1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 3
 kernel_size: 7
 stride:2
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "bn_1"
 type: "BatchNorm" 
 bottom: "conv_1" 
 top: "bn_1" 
 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "scale_1"
 type: "Scale" 
 bottom: "bn_1" 
 top: "scale_1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_1_branch1_bn1"
 type: "BatchNorm" 
 bottom: "scale_1" 
 top: "residual_1_branch1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 }
batch_norm_param {
        use_global_stats: false
 } 
}
layer {
 name: "residual_1_branch1_scale1"
 type: "Scale" 
 bottom: "residual_1_branch1_bn1" 
 top: "residual_1_branch1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_1_branch1_relu1"
 type: "ReLU" 
 bottom: "residual_1_branch1_scale1" 
 top: "residual_1_branch1_relu1" 
}
layer {
 name: "residual_1_branch1_conv1"
 type: "Convolution" 
 bottom: "residual_1_branch1_relu1" 
 top: "residual_1_branch1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_1_branch1_bn2"
 type: "BatchNorm" 
 bottom: "residual_1_branch1_conv1" 
 top: "residual_1_branch1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}

layer {
 name: "residual_1_branch1_scale2"
 type: "Scale" 
 bottom: "residual_1_branch1_bn2" 
 top: "residual_1_branch1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_1_branch1_relu2"
 type: "ReLU" 
 bottom: "residual_1_branch1_scale2" 
 top: "residual_1_branch1_relu2" 
}
layer {
 name: "residual_1_branch1_conv2"
 type: "Convolution" 
 bottom: "residual_1_branch1_relu2" 
 top: "residual_1_branch1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_1_branch1_bn3"
 type: "BatchNorm" 
 bottom: "residual_1_branch1_conv2" 
 top: "residual_1_branch1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "residual_1_branch1_scale3"
 type: "Scale" 
 bottom: "residual_1_branch1_bn3" 
 top: "residual_1_branch1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_1_branch1_relu3"
 type: "ReLU" 
 bottom: "residual_1_branch1_scale3" 
 top: "residual_1_branch1_relu3" 
}
layer {
 name: "residual_1_branch1_conv3"
 type: "Convolution" 
 bottom: "residual_1_branch1_relu3" 
 top: "residual_1_branch1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_1_branch2_conv"
 type: "Convolution" 
 bottom: "scale_1" 
 top: "residual_1_branch2_conv" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_1"
 type: "Eltwise" 
 bottom: "residual_1_branch1_conv3" 
 top: "residual_1" 
 bottom: "residual_1_branch2_conv" 
 eltwise_param { 
 operation: SUM 
 } 
 }
layer {
 name: "pooling"
 type: "Pooling" 
 bottom: "residual_1" 
 top: "pooling" 
 pooling_param { 
 pool: MAX 
 kernel_size: 2 
 stride: 2 
 } 
 }
layer {
 name: "residual_2_branch1_bn1"
 type: "BatchNorm" 
 bottom: "pooling" 
 top: "residual_2_branch1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "residual_2_branch1_scale1"
 type: "Scale" 
 bottom: "residual_2_branch1_bn1" 
 top: "residual_2_branch1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_2_branch1_relu1"
 type: "ReLU" 
 bottom: "residual_2_branch1_scale1" 
 top: "residual_2_branch1_relu1" 
}
layer {
 name: "residual_2_branch1_conv1"
 type: "Convolution" 
 bottom: "residual_2_branch1_relu1" 
 top: "residual_2_branch1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_2_branch1_bn2"
 type: "BatchNorm" 
 bottom: "residual_2_branch1_conv1" 
 top: "residual_2_branch1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "residual_2_branch1_scale2"
 type: "Scale" 
 bottom: "residual_2_branch1_bn2" 
 top: "residual_2_branch1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_2_branch1_relu2"
 type: "ReLU" 
 bottom: "residual_2_branch1_scale2" 
 top: "residual_2_branch1_relu2" 
}
layer {
 name: "residual_2_branch1_conv2"
 type: "Convolution" 
 bottom: "residual_2_branch1_relu2" 
 top: "residual_2_branch1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_2_branch1_bn3"
 type: "BatchNorm" 
 bottom: "residual_2_branch1_conv2" 
 top: "residual_2_branch1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "residual_2_branch1_scale3"
 type: "Scale" 
 bottom: "residual_2_branch1_bn3" 
 top: "residual_2_branch1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_2_branch1_relu3"
 type: "ReLU" 
 bottom: "residual_2_branch1_scale3" 
 top: "residual_2_branch1_relu3" 
}
layer {
 name: "residual_2_branch1_conv3"
 type: "Convolution" 
 bottom: "residual_2_branch1_relu3" 
 top: "residual_2_branch1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_2_branch2_conv"
 type: "Convolution" 
 bottom: "pooling" 
 top: "residual_2_branch2_conv" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_2"
 type: "Eltwise" 
 bottom: "residual_2_branch1_conv3" 
 top: "residual_2" 
 bottom: "residual_2_branch2_conv" 
 eltwise_param { 
 operation: SUM 
 } 
 }
layer {
 name: "residual_3_branch1_bn1"
 type: "BatchNorm" 
 bottom: "residual_2" 
 top: "residual_3_branch1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "residual_3_branch1_scale1"
 type: "Scale" 
 bottom: "residual_3_branch1_bn1" 
 top: "residual_3_branch1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_3_branch1_relu1"
 type: "ReLU" 
 bottom: "residual_3_branch1_scale1" 
 top: "residual_3_branch1_relu1" 
}
layer {
 name: "residual_3_branch1_conv1"
 type: "Convolution" 
 bottom: "residual_3_branch1_relu1" 
 top: "residual_3_branch1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_3_branch1_bn2"
 type: "BatchNorm" 
 bottom: "residual_3_branch1_conv1" 
 top: "residual_3_branch1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "residual_3_branch1_scale2"
 type: "Scale" 
 bottom: "residual_3_branch1_bn2" 
 top: "residual_3_branch1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_3_branch1_relu2"
 type: "ReLU" 
 bottom: "residual_3_branch1_scale2" 
 top: "residual_3_branch1_relu2" 
}
layer {
 name: "residual_3_branch1_conv2"
 type: "Convolution" 
 bottom: "residual_3_branch1_relu2" 
 top: "residual_3_branch1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_3_branch1_bn3"
 type: "BatchNorm" 
 bottom: "residual_3_branch1_conv2" 
 top: "residual_3_branch1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "residual_3_branch1_scale3"
 type: "Scale" 
 bottom: "residual_3_branch1_bn3" 
 top: "residual_3_branch1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_3_branch1_relu3"
 type: "ReLU" 
 bottom: "residual_3_branch1_scale3" 
 top: "residual_3_branch1_relu3" 
}
layer {
 name: "residual_3_branch1_conv3"
 type: "Convolution" 
 bottom: "residual_3_branch1_relu3" 
 top: "residual_3_branch1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_3_branch2_conv"
 type: "Convolution" 
 bottom: "residual_2" 
 top: "residual_3_branch2_conv" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_3"
 type: "Eltwise" 
 bottom: "residual_3_branch1_conv3" 
 top: "residual_3" 
 bottom: "residual_3_branch2_conv" 
 eltwise_param { 
 operation: SUM 
 } 
 }
layer {
 name: "residual_4_branch1_bn1"
 type: "BatchNorm" 
 bottom: "residual_3" 
 top: "residual_4_branch1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "residual_4_branch1_scale1"
 type: "Scale" 
 bottom: "residual_4_branch1_bn1" 
 top: "residual_4_branch1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_4_branch1_relu1"
 type: "ReLU" 
 bottom: "residual_4_branch1_scale1" 
 top: "residual_4_branch1_relu1" 
}
layer {
 name: "residual_4_branch1_conv1"
 type: "Convolution" 
 bottom: "residual_4_branch1_relu1" 
 top: "residual_4_branch1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_4_branch1_bn2"
 type: "BatchNorm" 
 bottom: "residual_4_branch1_conv1" 
 top: "residual_4_branch1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "residual_4_branch1_scale2"
 type: "Scale" 
 bottom: "residual_4_branch1_bn2" 
 top: "residual_4_branch1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_4_branch1_relu2"
 type: "ReLU" 
 bottom: "residual_4_branch1_scale2" 
 top: "residual_4_branch1_relu2" 
}
layer {
 name: "residual_4_branch1_conv2"
 type: "Convolution" 
 bottom: "residual_4_branch1_relu2" 
 top: "residual_4_branch1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_4_branch1_bn3"
 type: "BatchNorm" 
 bottom: "residual_4_branch1_conv2" 
 top: "residual_4_branch1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "residual_4_branch1_scale3"
 type: "Scale" 
 bottom: "residual_4_branch1_bn3" 
 top: "residual_4_branch1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_4_branch1_relu3"
 type: "ReLU" 
 bottom: "residual_4_branch1_scale3" 
 top: "residual_4_branch1_relu3" 
}
layer {
 name: "residual_4_branch1_conv3"
 type: "Convolution" 
 bottom: "residual_4_branch1_relu3" 
 top: "residual_4_branch1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_4_branch2_conv"
 type: "Convolution" 
 bottom: "residual_3" 
 top: "residual_4_branch2_conv" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_4"
 type: "Eltwise" 
 bottom: "residual_4_branch1_conv3" 
 top: "residual_4" 
 bottom: "residual_4_branch2_conv" 
 eltwise_param { 
 operation: SUM 
 } 
 }
layer {
 name: "hourglass1_pooling"
 type: "Pooling" 
 bottom: "residual_4" 
 top: "hourglass1_pooling" 
 pooling_param { 
 pool: MAX 
 kernel_size: 2 
 stride: 2 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_pooling" 
 top: "hourglass1_branch1_res1_branch1_sub1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_scale1"
 type: "Scale" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_bn1" 
 top: "hourglass1_branch1_res1_branch1_sub1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_relu1"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_scale1" 
 top: "hourglass1_branch1_res1_branch1_sub1_relu1" 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_conv1"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_relu1" 
 top: "hourglass1_branch1_res1_branch1_sub1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_conv1" 
 top: "hourglass1_branch1_res1_branch1_sub1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_scale2"
 type: "Scale" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_bn2" 
 top: "hourglass1_branch1_res1_branch1_sub1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_relu2"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_scale2" 
 top: "hourglass1_branch1_res1_branch1_sub1_relu2" 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_conv2"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_relu2" 
 top: "hourglass1_branch1_res1_branch1_sub1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_bn3"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_conv2" 
 top: "hourglass1_branch1_res1_branch1_sub1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_scale3"
 type: "Scale" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_bn3" 
 top: "hourglass1_branch1_res1_branch1_sub1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_relu3"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_scale3" 
 top: "hourglass1_branch1_res1_branch1_sub1_relu3" 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_conv3"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_relu3" 
 top: "hourglass1_branch1_res1_branch1_sub1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_pooling" 
 top: "hourglass1_branch1_res1_branch1_sub2_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_scale1"
 type: "Scale" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_bn1" 
 top: "hourglass1_branch1_res1_branch1_sub2_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_relu1"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_scale1" 
 top: "hourglass1_branch1_res1_branch1_sub2_relu1" 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_conv1"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_relu1" 
 top: "hourglass1_branch1_res1_branch1_sub2_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_conv1" 
 top: "hourglass1_branch1_res1_branch1_sub2_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_scale2"
 type: "Scale" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_bn2" 
 top: "hourglass1_branch1_res1_branch1_sub2_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_relu2"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_scale2" 
 top: "hourglass1_branch1_res1_branch1_sub2_relu2" 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_conv2"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_relu2" 
 top: "hourglass1_branch1_res1_branch1_sub2_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_concat"
 type: "Concat" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_conv3" 
 top: "hourglass1_branch1_res1_branch1_concat" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_conv2"
 concat_param { 
 axis: 1
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_conv_linear"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1_branch1_concat" 
 top: "hourglass1_branch1_res1_branch1_conv_linear" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_linear_batch"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1_branch1_conv_linear" 
 top: "hourglass1_branch1_res1_branch1_linear_batch" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res1_branch1_linear_scale"
 type: "Scale" 
 bottom: "hourglass1_branch1_res1_branch1_linear_batch" 
 top: "hourglass1_branch1_res1_branch1_linear_scale" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch2_conv"
 type: "Convolution" 
 bottom: "hourglass1_pooling" 
 top: "hourglass1_branch1_res1_branch2_conv" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1"
 type: "Eltwise" 
 bottom: "hourglass1_branch1_res1_branch1_linear_scale" 
 top: "hourglass1_branch1_res1" 
 bottom: "hourglass1_branch1_res1_branch2_conv" 
 eltwise_param { 
 operation: SUM 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1" 
 top: "hourglass1_branch1_res2_branch1_sub1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_scale1"
 type: "Scale" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_bn1" 
 top: "hourglass1_branch1_res2_branch1_sub1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_relu1"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_scale1" 
 top: "hourglass1_branch1_res2_branch1_sub1_relu1" 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_conv1"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_relu1" 
 top: "hourglass1_branch1_res2_branch1_sub1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_conv1" 
 top: "hourglass1_branch1_res2_branch1_sub1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_scale2"
 type: "Scale" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_bn2" 
 top: "hourglass1_branch1_res2_branch1_sub1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_relu2"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_scale2" 
 top: "hourglass1_branch1_res2_branch1_sub1_relu2" 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_conv2"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_relu2" 
 top: "hourglass1_branch1_res2_branch1_sub1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_bn3"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_conv2" 
 top: "hourglass1_branch1_res2_branch1_sub1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_scale3"
 type: "Scale" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_bn3" 
 top: "hourglass1_branch1_res2_branch1_sub1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_relu3"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_scale3" 
 top: "hourglass1_branch1_res2_branch1_sub1_relu3" 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_conv3"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_relu3" 
 top: "hourglass1_branch1_res2_branch1_sub1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1" 
 top: "hourglass1_branch1_res2_branch1_sub2_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_scale1"
 type: "Scale" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_bn1" 
 top: "hourglass1_branch1_res2_branch1_sub2_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_relu1"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_scale1" 
 top: "hourglass1_branch1_res2_branch1_sub2_relu1" 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_conv1"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_relu1" 
 top: "hourglass1_branch1_res2_branch1_sub2_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_conv1" 
 top: "hourglass1_branch1_res2_branch1_sub2_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_scale2"
 type: "Scale" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_bn2" 
 top: "hourglass1_branch1_res2_branch1_sub2_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_relu2"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_scale2" 
 top: "hourglass1_branch1_res2_branch1_sub2_relu2" 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_conv2"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_relu2" 
 top: "hourglass1_branch1_res2_branch1_sub2_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_concat"
 type: "Concat" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_conv3" 
 top: "hourglass1_branch1_res2_branch1_concat" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_conv2"
 concat_param { 
 axis: 1
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_conv_linear"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res2_branch1_concat" 
 top: "hourglass1_branch1_res2_branch1_conv_linear" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_linear_batch"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2_branch1_conv_linear" 
 top: "hourglass1_branch1_res2_branch1_linear_batch" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res2_branch1_linear_scale"
 type: "Scale" 
 bottom: "hourglass1_branch1_res2_branch1_linear_batch" 
 top: "hourglass1_branch1_res2_branch1_linear_scale" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch2_conv"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1" 
 top: "hourglass1_branch1_res2_branch2_conv" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2"
 type: "Eltwise" 
 bottom: "hourglass1_branch1_res2_branch1_linear_scale" 
 top: "hourglass1_branch1_res2" 
 bottom: "hourglass1_branch1_res2_branch2_conv" 
 eltwise_param { 
 operation: SUM 
 } 
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2" 
 top: "hourglass1_branch1_res3_branch1_sub1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_scale1"
 type: "Scale" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_bn1" 
 top: "hourglass1_branch1_res3_branch1_sub1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_relu1"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_scale1" 
 top: "hourglass1_branch1_res3_branch1_sub1_relu1" 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_conv1"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_relu1" 
 top: "hourglass1_branch1_res3_branch1_sub1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_conv1" 
 top: "hourglass1_branch1_res3_branch1_sub1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_scale2"
 type: "Scale" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_bn2" 
 top: "hourglass1_branch1_res3_branch1_sub1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_relu2"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_scale2" 
 top: "hourglass1_branch1_res3_branch1_sub1_relu2" 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_conv2"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_relu2" 
 top: "hourglass1_branch1_res3_branch1_sub1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_bn3"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_conv2" 
 top: "hourglass1_branch1_res3_branch1_sub1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_scale3"
 type: "Scale" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_bn3" 
 top: "hourglass1_branch1_res3_branch1_sub1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_relu3"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_scale3" 
 top: "hourglass1_branch1_res3_branch1_sub1_relu3" 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_conv3"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_relu3" 
 top: "hourglass1_branch1_res3_branch1_sub1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2" 
 top: "hourglass1_branch1_res3_branch1_sub2_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_scale1"
 type: "Scale" 
 bottom: "hourglass1_branch1_res3_branch1_sub2_bn1" 
 top: "hourglass1_branch1_res3_branch1_sub2_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_relu1"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res3_branch1_sub2_scale1" 
 top: "hourglass1_branch1_res3_branch1_sub2_relu1" 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_conv1"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res3_branch1_sub2_relu1" 
 top: "hourglass1_branch1_res3_branch1_sub2_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res3_branch1_sub2_conv1" 
 top: "hourglass1_branch1_res3_branch1_sub2_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param {
        use_global_stats: false
 }
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_scale2"
 type: "Scale" 
 bottom: "hourglass1_branch1_res3_branch1_sub2_bn2" 
 top: "hourglass1_branch1_res3_branch1_sub2_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_relu2"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res3_branch1_sub2_scale2" 
 top: "hourglass1_branch1_res3_branch1_sub2_relu2" 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub2_conv2"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res3_branch1_sub2_relu2" 
 top: "hourglass1_branch1_res3_branch1_sub2_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_concat"
 type: "Concat" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_conv3" 
 top: "hourglass1_branch1_res3_branch1_concat" 
 bottom: "hourglass1_branch1_res3_branch1_sub2_conv2"
 concat_param { 
 axis: 1
 } 
}
layer {
 name: "hourglass1_branch1_res3_branch1_conv_linear"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res3_branch1_concat" 
 top: "hourglass1_branch1_res3_branch1_conv_linear" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01 
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_linear_batch"
 type: "BatchNorm" 
